<?php 
//----------------1:1-----------
//关联字段在那张表都可以
城市表 city
cid     name      
 1      北京        
 2      上海        
 3      杭州        

区号表 code
 coid   num        cid
  1     020         2
  2     010         1
  3     0571        3

//----------------1:N--------------
//关联字段放在多的一方
//多的保存少的
分类表 category
cid     cname         
 1       新闻           
 2       娱乐           
 3       体育

文章表 arc
aid     title  						   cid
 1      虚拟现实2016年将首先在游戏中实现     1
 2      ab怀孕了  						2
 3      科比下个赛季将要退役了   			3
 4      马老师唱了一首歌  					2
 5      后盾网在纳斯达克上市了  			1

//分类表
create table cate(
	cid int unsigned primary key auto_increment,
	cname char(20) not null default ''
);
//文章表
create table arc(
	aid int unsigned primary key auto_increment,
	title char(120) not null default '',
	cid int unsigned not null default 0
);
//笛卡尔积（无意义的）
select * from arc,cate;
+-----+------------------------------------------------+-----+-----+--------+
| aid | title                                          | cid | cid | cname  |
+-----+------------------------------------------------+-----+-----+--------+
|   1 | 虚拟现实2016年将首先在游戏中实现               |   1 |   1 | 新闻   |
|   1 | 虚拟现实2016年将首先在游戏中实现               |   1 |   2 | 娱乐   |
|   1 | 虚拟现实2016年将首先在游戏中实现               |   1 |   3 | 体育   |
|   2 | ab怀孕了                                       |   2 |   1 | 新闻   |
|   2 | ab怀孕了                                       |   2 |   2 | 娱乐   |
|   2 | ab怀孕了                                       |   2 |   3 | 体育   |
|   3 | 科比下个赛季将要退役了                         |   3 |   1 | 新闻   |
|   3 | 科比下个赛季将要退役了                         |   3 |   2 | 娱乐   |
|   3 | 科比下个赛季将要退役了                         |   3 |   3 | 体育   |
|   4 | 马老师唱了一首歌                               |   2 |   1 | 新闻   |
|   4 | 马老师唱了一首歌                               |   2 |   2 | 娱乐   |
|   4 | 马老师唱了一首歌                               |   2 |   3 | 体育   |
|   5 | 后盾网在纳斯达克上市了                         |   1 |   1 | 新闻   |
|   5 | 后盾网在纳斯达克上市了                         |   1 |   2 | 娱乐   |
|   5 | 后盾网在纳斯达克上市了                         |   1 |   3 | 体育   |
+-----+------------------------------------------------+-----+-----+--------+

//加完限制条的 笛卡尔积（有意义的）
select * from arc as a,cate as c where a.cid=c.cid;
+-----+------------------------------------------------+-----+-----+--------+
| aid | title                                          | cid | cid | cname  |
+-----+------------------------------------------------+-----+-----+--------+
|   1 | 虚拟现实2016年将首先在游戏中实现                    |   1 |   1 | 新闻   |
|   2 | ab怀孕了                                       |   2 |   2 | 娱乐   |
|   3 | 科比下个赛季将要退役了                           |    3 |   3 | 体育   |
|   4 | 马老师唱了一首歌                                |   2 |   2 | 娱乐   |
|   5 | 后盾网在纳斯达克上市了                           |   1 |   1 | 新闻   |
+-----+------------------------------------------------+-----+-----+--------+
//查询指定字段
select aid,title,cname from arc as a,cate as c where a.cid=c.cid;
+-----+------------------------------------------------+--------+
| aid | title                                          | cname  |
+-----+------------------------------------------------+--------+
|   1 | 虚拟现实2016年将首先在游戏中实现               | 新闻   |
|   2 | ab怀孕了                                       | 娱乐   |
|   3 | 科比下个赛季将要退役了                         | 体育   |
|   4 | 马老师唱了一首歌                               | 娱乐   |
|   5 | 后盾网在纳斯达克上市了                         | 新闻   |
+-----+------------------------------------------------+--------+


//内部连接 inner join(和上面的写法比起来，推荐写法)
//join 关联
//on 关联的条件
select * from arc as a join cate as c on a.cid=c.cid;
+-----+------------------------------------------------+-----+-----+--------+
| aid | title                                          | cid | cid | cname  |
+-----+------------------------------------------------+-----+-----+--------+
|   1 | 虚拟现实2016年将首先在游戏中实现               |   1 |   1 | 新闻   |
|   2 | ab怀孕了                                       |   2 |   2 | 娱乐   |
|   3 | 科比下个赛季将要退役了                         |   3 |   3 | 体育   |
|   4 | 马老师唱了一首歌                               |   2 |   2 | 娱乐   |
|   5 | 后盾网在纳斯达克上市了                         |   1 |   1 | 新闻   |
+-----+------------------------------------------------+-----+-----+--------+

//关联之后的where的使用
select * from arc as a join cate as c on a.cid=c.cid where a.cid=2;
+-----+--------------------------+-----+-----+--------+
| aid | title                    | cid | cid | cname  |
+-----+--------------------------+-----+-----+--------+
|   2 | ab怀孕了                  |   2 |   2 | 娱乐   |
|   4 | 马老师唱了一首歌           |   2 |   2 | 娱乐   |
+-----+--------------------------+-----+-----+--------+

//右连接 right join,偏向右边的表，无论条件是否成立，数据都会出来
select * from arc as a right join cate as c on a.cid=c.cid;
+------+------------------------------------------------+------+-----+--------+
| aid  | title                                          | cid  | cid | cname  |
+------+------------------------------------------------+------+-----+--------+
|    1 | 虚拟现实2016年将首先在游戏中实现                   |    1 |   1 | 新闻   |
|    2 | ab怀孕了                                       |    2 |   2 | 娱乐   |
|    3 | 科比下个赛季将要退役了                            |    3 |   3 | 体育   |
|    4 | 马老师唱了一首歌                                |    2 |   2 | 娱乐   |
|    5 | 后盾网在纳斯达克上市了                            |    1 |   1 | 新闻   |
| NULL | NULL                                           | NULL |   4 | 军事   |
+------+------------------------------------------------+------+-----+--------+

//查询没有文章的分类
select * from arc as a right join cate as c on a.cid=c.cid where aid is null;
+------+-------+------+-----+--------+
| aid  | title | cid  | cid | cname  |
+------+-------+------+-----+--------+
| NULL | NULL  | NULL |   4 | 军事   |
+------+-------+------+-----+--------+

//统计每个分类下面的文章总数
select cname,count(*) from cate as c join arc as a on a.cid=c.cid group by cname;
+--------+----------+
| cname  | count(*) |
+--------+----------+
| 体育   |        1 |
| 娱乐   |        2 |
| 新闻   |        2 |
+--------+----------+


//查询和“后盾网”同一分类下面的文章
//方法1：
//(1)获得后盾网所对应的cid
select cid from arc where title='后盾网';
+-----+
| cid |
+-----+
|   1 |
+-----+
//(2)根据cid查询
select * from arc where cid=1;
+-----+--------------+-----+
| aid | title        | cid |
+-----+--------------+-----+
|   1 | 虚拟现实     |   1 |
|   5 | 后盾网       |   1 |
|   6 | PHP          |   1 |
+-----+--------------+-----+

//方法2（子查询）：
select * from arc where cid=(select cid from arc where title='后盾网');

//方法3(自关联)：
select * from arc as a1 join arc as a2 on a1.cid=a2.cid;
+-----+--------------+-----+-----+--------------+-----+
| aid | title        | cid | aid | title        | cid |
+-----+--------------+-----+-----+--------------+-----+
|   1 | 虚拟现实     |   1 |   1 | 虚拟现实     |   1 |
|   5 | 后盾网       |   1 |   1 | 虚拟现实     |   1 |
|   6 | PHP          |   1 |   1 | 虚拟现实     |   1 |
|   2 | ab怀孕了     |   2 |   2 | ab怀孕了     |   2 |
|   4 | 马老师       |   2 |   2 | ab怀孕了     |   2 |
|   3 | 科比         |   3 |   3 | 科比         |   3 |
|   2 | ab怀孕了     |   2 |   4 | 马老师       |   2 |
|   4 | 马老师       |   2 |   4 | 马老师       |   2 |
|   1 | 虚拟现实     |   1 |   5 | 后盾网       |   1 |
|   5 | 后盾网       |   1 |   5 | 后盾网       |   1 |
|   6 | PHP          |   1 |   5 | 后盾网       |   1 |
|   1 | 虚拟现实     |   1 |   6 | PHP          |   1 |
|   5 | 后盾网       |   1 |   6 | PHP          |   1 |
|   6 | PHP          |   1 |   6 | PHP          |   1 |
+-----+--------------+-----+-----+--------------+-----+

select * from arc as a1 join arc as a2 on a1.cid=a2.cid where a2.title='后盾网';
+-----+--------------+-----+-----+-----------+-----+
| aid | title        | cid | aid | title     | cid |
+-----+--------------+-----+-----+-----------+-----+
|   1 | 虚拟现实      |   1 |   5 | 后盾网    |   1 |
|   5 | 后盾网        |   1 |   5 | 后盾网    |   1 |
|   6 | PHP          |   1 |   5 | 后盾网    |   1 |
+-----+--------------+-----+-----+-----------+-----+




//--------------N:N-------------------
文章表 arc
aid     title  						     
 1      虚拟现实2016年将首先在游戏中实现    
 2      ab怀孕了  						
 3      科比下个赛季将要退役了   			
 4      马老师唱了一首歌  					
 5      后盾网			

中间表 arc_tag
aid     tid
 1       1
 1       2
 1       3
 3       6
 5       2
 5		 5
 5		 6


标签表 tag
 tid      tname      
  1        游戏        
  2        火爆        
  3        热门
  4        新闻
  5        难听
  6        胡说

//3张表关联
// select * from arc as a join arc_tag as at on a.aid=at.aid join tag as t on at.tid=t.tid

















 ?>